src/bsl/Documents/гкс_ЗаписьВОчередьПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ЗаписьВОчередьПриемкиПЛК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_ОчередьПриемкиПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>ERP-981</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Comment>Номер транспортного средства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаписиВОчередь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СтатусыЗаписейВОчередиПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СтатусыЗаписейВОчередиПриемкиПЛК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьВОчередь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыЗаписьВОчередь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОчередьПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОчередьПриемкиПЛК</Name>
			<Comment>Очередь приемки транспортных средств на ПЛК</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Comment>Номер транспортного средства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ГрафикПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ГрафикПриемкиПЛК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧасПоЭО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_СтатусыЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СтатусыЭлектроннойОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пришел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПришел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_ЗаписьВОчередьПриемкиПЛК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	гкс_ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВыполнитьДополнительныеДействияПередЗаписьюВРежимеОбменаДанными(Отказ, РежимЗаписи, РежимПроведения);
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДозаполнитьОбъектПередЗаписью();
	ПроверитьЗаполнениеОбъектаПередЗаписью(Отказ);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьДоступностьМестВГрафикеИОчереди(Отказ);
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УдалитьСтатусОтмененВОчереди();
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	ДобавитьСтатусОтмененВОчереди();
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДополнительныеДействияПередЗаписьюВРежимеОбменаДанными

Процедура ВыполнитьДополнительныеДействияПередЗаписьюВРежимеОбменаДанными(Отказ, РежимЗаписи, РежимПроведения)
																		  
	Если Отказ ИЛИ НЕ ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьОчисткуСтатусаЗаписиРегистрацииВОчереди() Тогда
		ОчиститьСтатусЗаписиРегистрацииВОчередиПриемки();				
	КонецЕсли;
	             
КонецПроцедуры

Функция ВыполнятьОчисткуСтатусаЗаписиРегистрацииВОчереди()
	
	Возврат НЕ ЭтоНовый() 
	        И ПометкаУдаления 
			И ДополнительныеСвойства.Свойство("ПометкаУдаленияПриОбработкеИАС"); 
	
КонецФункции

Процедура ОчиститьСтатусЗаписиРегистрацииВОчередиПриемки()
		
	РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.
		УдалитьЗапись(Новый Структура("ЗаписьВОчередь", Ссылка));
	
КонецПроцедуры

#КонецОбласти

// Добавляет запись со статусом Отменен из регистра сведений Статусы записей в очереди приемки ПЛК.
//
Процедура ДобавитьСтатусОтмененВОчереди()
	
	РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.УстановитьСтатусОтменен(
		ТочкаМаршрута,
		НачалоПериода,
		Ссылка,
		Ложь);
		
КонецПроцедуры

// Удаляет запись со статусом Отменен из регистра сведений Статусы записей в очереди приемки ПЛК.
//
Процедура УдалитьСтатусОтмененВОчереди()
	
	ТекСтатус = РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.ТекущийСтатус(Ссылка);
	Если ТекСтатус = Перечисления.гкс_СтатусыЭлектроннойОчереди.Отменен Тогда
		 ОчиститьСтатусЗаписиРегистрацииВОчередиПриемки();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьПризнакОтменено()
	
	Режим = ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи;
	
	Если Режим = РежимЗаписиДокумента.ОтменаПроведения Или ПометкаУдаления Тогда 
		Отменено = Истина;	
	Иначе
		Отменено = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДозаполнитьОбъектПередЗаписью()
	
	ЗаполнитьОрганизацию();
	ИзменитьПризнакОтменено();
	
КонецПроцедуры

// Гкс+[ERP-1807] Коннова Н.В. 09.03.2021
Процедура ЗаполнитьОрганизацию()
		
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Организация");	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеОбъектаПередЗаписью(Отказ)
	
	Если УправлениеДоступом.ЕстьРоль("АдминистраторСистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ЧасовойПояс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");
	Если НЕ гкс_ЭлектроннаяОчередь.ДатаЗаявкиАктуальна(ОкончаниеПериода, ЧасовойПояс) Тогда
	
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Запрещено вносить записи в прошлые периоды!'"),
			Неопределено, "ОкончаниеПериода", "", Отказ);													  
	КонецЕсли;
	
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("НачалоПериода", НачалоПериода);
	ДанныеОбъекта.Вставить("ОкончаниеПериода", ОкончаниеПериода);
	ДанныеОбъекта.Вставить("Номенклатура", Номенклатура);
	ДанныеОбъекта.Вставить("ТочкаМаршрута", ТочкаМаршрута);
	ДанныеОбъекта.Вставить("ТипРегистрации", Перечисления.гкс_ТипРегистрации.Приемка);

	Если НЕ гкс_ЭлектроннаяОчередь.ПериодЭлектроннойОчередиЗаданКорректно(ДанныеОбъекта) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выбранный период не корректный!'"),
			Неопределено, "ОкончаниеПериода", "", Отказ);															  
	КонецЕсли;
	   	
КонецПроцедуры

#Область ДоступностьОчередей

Процедура ПроверитьДоступностьМестВГрафикеИОчереди(Отказ)
	
	Если Не ГрафикЗаполнен() Тогда	
		ТекстСообщения = НСтр("ru = 'На этот период график не заполнен!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "ОкончаниеПериода", "", Отказ);
	КонецЕсли;
	
	Если Не Отказ И НЕ ЕстьСвободноеМестоВОчереди() Тогда		
		ТекстСообщения = НСтр("ru = 'На этот период в очереди приемки уже существуют записи!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "ОкончаниеПериода", "", Отказ);											  
	КонецЕсли;
											  	
КонецПроцедуры

Функция ЕстьСвободноеМестоВОчереди()
		
	УстановитьБлокировкуОчереди();
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ТочкаМаршрута", ТочкаМаршрута);
	Параметры.Вставить("Номенклатура", Номенклатура);
	Параметры.Вставить("УсловиеПроезда", УсловиеПроезда);
	Параметры.Вставить("НачалоПериода", НачалоПериода);
	Параметры.Вставить("ОкончаниеПериода", ОкончаниеПериода);	
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Параметры.Вставить("Ссылка", Ссылка);	
	КонецЕсли;
	
	Возврат РегистрыСведений.гкс_ОчередьПриемкиПЛК.ЕстьСвободноеМесто(Параметры);
	
КонецФункции

Функция ГрафикЗаполнен()
			
	Период = Новый Структура("ДатаНачала, ДатаОкончания", НачалоПериода, ОкончаниеПериода);	
	Возврат РегистрыСведений.гкс_ГрафикПриемкиПЛК.ГрафикЗаполнен(Период, ТочкаМаршрута, Номенклатура, УсловиеПроезда);
	
КонецФункции

#КонецОбласти

#Область Блокировки

Процедура УстановитьБлокировкуОчереди()
	
	Диапазон = Новый Диапазон(НачалоПериода, ОкончаниеПериода);
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_ОчередьПриемкиПЛК");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ТочкаМаршрута", ТочкаМаршрута);
	ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
	ЭлементБлокировки.УстановитьЗначение("УсловиеПроезда", УсловиеПроезда);
	
	ЭлементБлокировки.УстановитьЗначение("НачалоПериода", Диапазон);
	ЭлементБлокировки.УстановитьЗначение("ОкончаниеПериода", Диапазон);
	
	Блокировка.Заблокировать();

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли
